Repository: develop4God/habitus_faith
Catalog: lib/l10n/app_*.arb
Languages: fr, pt, zh

# appTitle
source: Habitus Faith
fr: Habitus Foi
pt: Habitus Fé
zh: 信仰习惯

source: Start
fr: Commencer
pt: Começar
zh: 开始

source: Read Bible
fr: Bible
pt: Ler Bíblia
zh: 阅读圣经

source: My Habits
fr: Mes Habitudes
pt: Meus Hábitos
zh: 我的习惯

# noHabits
source: No habits yet
fr: Pas encore d'habitudes
pt: Ainda não tem hábitos
zh: 还没有习惯

source: Streak
fr: Série
pt: Sequência
zh: 连续

source: days
fr: jours
pt: dias
zh: 天

source: Best
fr: Meilleur
pt: Melhor
zh: 最佳

source: Add Habit
fr: Ajouter Habitude
pt: Adicionar Hábito
zh: 添加习惯

source: Delete Habit
fr: Supprimer Habitude
pt: Excluir Hábito
zh: 删除习惯

# deleteHabitConfirm
source: Are you sure you want to delete "{habitName}"?
fr: Êtes-vous sûr de vouloir supprimer "{habitName}"?
pt: Tem certeza de que deseja excluir "{habitName}"?
zh: 确定要删除"{habitName}"吗？

source: Cancel
fr: Annuler
pt: Cancelar
zh: 取消

source: Delete
fr: Supprimer
pt: Excluir
zh: 删除

source: Name
fr: Nom
pt: Nome
zh: 名称

source: Description
pt: Descrição
zh: 描述

source: Add
fr: Ajouter
pt: Adicionar
zh: 添加

source: Welcome to Habitus Faith
fr: Bienvenue à Habitus Foi
pt: Bem-vindo ao Habitus Fé
zh: 欢迎来到信仰习惯

# selectUpToThreeHabits
source: Select up to 3 habits to start your journey
fr: Sélectionnez jusqu'à 3 habitudes pour commencer votre voyage
pt: Selecione até 3 hábitos para começar sua jornada
zh: 选择最多3个习惯开始您的旅程

# continueButton
source: Continue
fr: Continuer
pt: Continuar
zh: 继续

# selectAtLeastOne
source: Please select at least one habit
fr: Veuillez sélectionner au moins une habitude
pt: Por favor, selecione pelo menos um hábito
zh: 请至少选择一个习惯

# maxThreeHabits
source: You can select up to 3 habits
fr: Vous pouvez sélectionner jusqu'à 3 habitudes
pt: Você pode selecionar até 3 hábitos
zh: 您最多可以选择3个习惯

source: Spiritual
fr: Spirituel
pt: Espiritual
zh: 灵性

source: Physical
fr: Physique
pt: Físico
zh: 身体

source: Relational
fr: Relationnel
pt: Relacional
zh: 关系

# habitCompleted
source: Habit completed! ðŸŽ‰
fr: Habitude terminée! 🎉
pt: Hábito concluído! 🎉
zh: 习惯完成！🎉

source: Tap to complete
fr: Appuyez pour terminer
pt: Toque para completar
zh: 点击完成

source: Completed
fr: Terminé
pt: Concluído
zh: 已完成

source: Current Streak
fr: Série Actuelle
pt: Sequência Atual
zh: 当前连续

source: Longest Streak
fr: Meilleure Série
pt: Melhor Sequência
zh: 最长连续

source: This Week
fr: Cette Semaine
pt: Esta Semana
zh: 本周

# predefinedHabit_morningPrayer_name
source: Morning Prayer
fr: Prière Matinale
pt: Oração Matinal
zh: 晨祷

# predefinedHabit_morningPrayer_description
source: Start your day with prayer and thanksgiving
fr: Commencez votre journée avec la prière et la gratitude
pt: Comece seu dia com oração e gratidão
zh: 以祷告和感恩开始您的一天

# predefinedHabit_bibleReading_name
source: Bible Reading
fr: Lecture Biblique
pt: Leitura Bíblica
zh: 读经

# predefinedHabit_bibleReading_description
source: Read and meditate on God's Word daily
fr: Lisez et méditez la Parole de Dieu quotidiennement
pt: Leia e medite na Palavra de Deus diariamente
zh: 每天阅读和默想神的话语

# predefinedHabit_worship_name
source: Worship
fr: Adoration
pt: Adoração
zh: 敬拜

# predefinedHabit_worship_description
source: Spend time in worship and praise
fr: Passez du temps en adoration et louange
pt: Passe tempo em adoração e louvor
zh: 花时间敬拜和赞美

# predefinedHabit_gratitude_name
source: Gratitude Journal
fr: Journal de Gratitude
pt: Diário de Gratidão
zh: 感恩日记

# predefinedHabit_gratitude_description
source: Write down what you're thankful for
fr: Écrivez ce dont vous êtes reconnaissant
pt: Escreva pelo que você é grato
zh: 写下您感恩的事情

# predefinedHabit_exercise_name
source: Exercise
fr: Exercice
pt: Exercício
zh: 锻炼

# predefinedHabit_exercise_description
source: Take care of your body, God's temple
fr: Prenez soin de votre corps, temple de Dieu
pt: Cuide do seu corpo, templo de Deus
zh: 照顾您的身体，神的殿

# predefinedHabit_healthyEating_name
source: Healthy Eating
fr: Alimentation Saine
pt: Alimentação Saudável
zh: 健康饮食

# predefinedHabit_healthyEating_description
source: Nourish your body with wholesome food
fr: Nourrissez votre corps avec des aliments sains
pt: Nutra seu corpo com alimentos saudáveis
zh: 用健康食物滋养您的身体

# predefinedHabit_sleep_name
source: Quality Sleep
fr: Sommeil de Qualité
pt: Sono de Qualidade
zh: 优质睡眠

# predefinedHabit_sleep_description
source: Get restful sleep to recharge
fr: Dormez bien pour vous ressourcer
pt: Durma bem para recarregar
zh: 好好休息以恢复精力

# predefinedHabit_meditation_name
source: Meditation
fr: Méditation
pt: Meditação
zh: 冥想

# predefinedHabit_meditation_description
source: Practice mindfulness and reflection
fr: Pratiquez la pleine conscience et la réflexion
pt: Pratique atenção plena e reflexão
zh: 练习正念和反思

# predefinedHabit_learning_name
source: Learning
fr: Apprentissage
pt: Aprendizado
zh: 学习

# predefinedHabit_learning_description
source: Grow in knowledge and wisdom
fr: Grandissez en connaissance et sagesse
pt: Cresça em conhecimento e sabedoria
zh: 在知识和智慧中成长

# predefinedHabit_creativity_name
source: Creative Time
fr: Temps Créatif
pt: Tempo Criativo
zh: 创意时间

# predefinedHabit_creativity_description
source: Express yourself through creative activities
fr: Exprimez-vous à travers des activités créatives
pt: Expresse-se através de atividades criativas
zh: 通过创意活动表达自己

# predefinedHabit_familyTime_name
source: Family Time
fr: Temps en Famille
pt: Tempo em Família
zh: 家庭时光

# predefinedHabit_familyTime_description
source: Spend quality time with loved ones
fr: Passez du temps de qualité avec vos proches
pt: Passe tempo de qualidade com seus entes queridos
zh: 与亲人共度美好时光

# predefinedHabit_service_name
source: Acts of Service
fr: Actes de Service
pt: Atos de Serviço
zh: 服务行动

# predefinedHabit_service_description
source: Serve others with love and compassion
fr: Servez les autres avec amour et compassion
pt: Sirva aos outros com amor e compaixão
zh: 以爱和同情服务他人

# onboardingErrorMessage
source: Failed to save habits. Please try again.
fr: Échec de la sauvegarde des habitudes. Veuillez réessayer.
pt: Falha ao salvar os hábitos. Por favor, tente novamente.

source: Retry
fr: Réessayer
pt: Tentar Novamente

source: Selected
fr: Sélectionné
pt: Selecionado

source: Category
fr: Catégorie
pt: Categoria
zh: 类别

source: Difficulty
fr: Difficulté
pt: Dificuldade
zh: 难度

source: Color
fr: Couleur
pt: Cor
zh: 颜色

source: optional
fr: optionnel
pt: opcional
zh: 可选

source: Edit
fr: Modifier
pt: Editar
zh: 编辑

source: Uncheck
fr: Décocher
pt: Desmarcar
zh: 取消勾选

source: Save
fr: Enregistrer
pt: Salvar
zh: 保存

source: Edit Habit
fr: Modifier l'Habitude
pt: Editar Hábito
zh: 编辑习惯

# defaultColor
source: Default
fr: Par défaut
pt: Padrão
zh: 默认

source: Statistics
fr: Statistiques
pt: Estatísticas
zh: 统计

source: Settings
fr: Paramètres
pt: Configurações
zh: 设置

source: Language
fr: Langue
pt: Idioma
zh: 语言

source: Notifications
pt: Notificações
zh: 通知

source: Notification Settings
fr: Paramètres de Notification
pt: Configurações de Notificação
zh: 通知设置

source: Language Settings
fr: Paramètres de Langue
pt: Configurações de Idioma
zh: 语言设置

source: Select Language
fr: Sélectionner la Langue
pt: Selecionar Idioma
zh: 选择语言

# languageInfo
source: The app will use your selected language for all text and interface elements.
fr: L'application utilisera la langue sélectionnée pour tous les textes et éléments d'interface.
pt: O aplicativo usará o idioma selecionado para todo o texto e elementos da interface.
zh: 应用程序将使用所选语言显示所有文本和界面元素。

source: Notifications enabled
fr: Notifications activées
pt: Notificações ativadas
zh: 通知已启用

source: Notifications disabled
fr: Notifications désactivées
pt: Notificações desativadas
zh: 通知已禁用

# notificationTimeUpdated
source: Notification time updated to
fr: Heure de notification mise à jour à
pt: Horário de notificação atualizado para
zh: 通知时间已更新为

source: Enable Notifications
fr: Activer les Notifications
pt: Ativar Notificações
zh: 启用通知

source: Notifications On
fr: Notifications Activées
pt: Notificações Ativadas
zh: 通知已开启

source: Notifications Off
fr: Notifications Désactivées
pt: Notificações Desativadas
zh: 通知已关闭

# receiveReminderNotifications
source: Receive daily reminder notifications
fr: Recevoir des notifications de rappel quotidien
pt: Receber notificações de lembrete diário
zh: 接收每日提醒通知

source: Notification Time
fr: Heure de Notification
pt: Horário de Notificação
zh: 通知时间

source: Select notification time
fr: Sélectionner l'heure de notification
pt: Selecionar horário de notificação
zh: 选择通知时间

source: Current time
fr: Heure actuelle
pt: Horário atual
zh: 当前时间

# notificationInfo
source: You will receive a daily reminder at your selected time to complete your habits.
fr: Vous recevrez un rappel quotidien à l'heure sélectionnée pour compléter vos habitudes.
pt: Você receberá um lembrete diário no horário selecionado para completar seus hábitos.
zh: 您将在所选时间收到每日提醒以完成您的习惯。

# highRiskWarning
source: High risk of abandoning this habit today!
fr: Risque élevé d'abandonner cette habitude aujourd'hui !
pt: Alto risco de abandonar este hábito hoje!
zh: 今天有高风险放弃这个习惯！

# riskPercentage
source: {percent}% probability of abandonment
fr: {percent}% de probabilité d'abandon
pt: {percent}% de probabilidade de abandono
zh: {percent}% 放弃的概率

source: Complete Now
fr: Terminer Maintenant
pt: Completar Agora
zh: 立即完成

# abandonmentNudgeTitle
source: Reduce habit "{habitName}"?
fr: Réduire l'habitude "{habitName}"?
pt: Reduzir hábito "{habitName}"?

# abandonmentNudgeBody
source: Reduce to {minutes}min? We noticed you might abandon this habit
fr: Réduire à {minutes}min? Nous avons remarqué que vous pourriez abandonner cette habitude
pt: Reduzir para {minutes}min? Notamos que você pode abandonar este hábito

source: Generate Micro-Habits
fr: Générer des Micro-Habitudes
pt: Gerar Micro-Hábitos
zh: 生成微习惯

source: AI-Generated Habits
fr: Habitudes Générées par IA
pt: Hábitos Gerados por IA
zh: AI生成的习惯

source: Your Goal
fr: Votre Objectif
pt: Sua Meta
zh: 你的目标

# goalHint
source: What would you like to improve? (e.g., Pray more consistently)
fr: Que souhaitez-vous améliorer? (ex: Prier plus régulièrement)
pt: O que você gostaria de melhorar? (ex: Orar mais consistentemente)
zh: 你想改进什么？（例如：更持续地祷告）

# goalRequired
source: Please enter your goal
fr: Veuillez saisir votre objectif
pt: Por favor insira sua meta
zh: 请输入你的目标

# goalTooShort
source: Goal must be at least 10 characters
fr: L'objectif doit contenir au moins 10 caractères
pt: A meta deve ter pelo menos 10 caracteres
zh: 目标至少需要10个字符

# goalTooLong
source: Goal cannot exceed 200 characters
fr: L'objectif ne peut pas dépasser 200 caractères
pt: A meta não pode exceder 200 caracteres
zh: 目标不能超过200个字符

# failurePattern
source: When do you usually fail? (Optional)
fr: Quand échouez-vous généralement? (Facultatif)
pt: Quando você costuma falhar? (Opcional)
zh: 你通常什么时候失败？（可选）

# failurePatternHint
source: e.g., I forget during busy mornings
fr: ex: J'oublie pendant les matins occupés
pt: ex: Esqueço nas manhãs ocupadas
zh: 例如：在忙碌的早晨我会忘记

source: Generate Habits
fr: Générer des Habitudes
pt: Gerar Hábitos
zh: 生成习惯

source: Generating...
fr: Génération...
pt: Gerando...
zh: 生成中...

# generatingHabits
source: Generating personalized micro-habits for you...
fr: Génération de micro-habitudes personnalisées pour vous...
pt: Gerando micro-hábitos personalizados para você...
zh: 正在为你生成个性化微习惯...

# generatedHabitsTitle
source: Your Personalized Micro-Habits
fr: Vos Micro-Habitudes Personnalisées
pt: Seus Micro-Hábitos Personalizados
zh: 你的个性化微习惯

# selectHabitsToAdd
source: Select habits to add to your tracking:
fr: Sélectionnez les habitudes à ajouter à votre suivi:
pt: Selecione hábitos para adicionar ao seu rastreamento:
zh: 选择要添加到跟踪的习惯：

source: Save Selected
fr: Enregistrer la Sélection
pt: Salvar Selecionados
zh: 保存选中的

source: Saving...
fr: Enregistrement...
pt: Salvando...
zh: 保存中...

# habitsAdded
source: {count} habit(s) added successfully!
fr: {count} habitude(s) ajoutée(s) avec succès!
pt: {count} hábito(s) adicionado(s) com sucesso!
zh: 成功添加了{count}个习惯！

source: Bible Verse
fr: Verset Biblique
pt: Versículo Bíblico
zh: 圣经经文

source: Purpose
fr: Objectif
pt: Propósito
zh: 目的

# remaining
source: {count} remaining
fr: {count} restant(s)
pt: {count} restante(s)
zh: 剩余{count}次

# monthlyLimit
source: Monthly limit: {limit} generations
fr: Limite mensuelle: {limit} générations
pt: Limite mensal: {limit} gerações
zh: 每月限制：{limit}次生成

# rateLimitReached
source: Monthly limit reached. Try again next month.
fr: Limite mensuelle atteinte. Réessayez le mois prochain.
pt: Limite mensal atingido. Tente novamente no próximo mês.
zh: 已达到每月限制。请下个月再试。

# generationFailed
source: Failed to generate habits. Please try again.
fr: Échec de la génération d'habitudes. Veuillez réessayer.
pt: Falha ao gerar hábitos. Por favor tente novamente.
zh: 生成习惯失败。请重试。

# apiTimeout
source: Request timed out. Please check your connection and try again.
fr: Délai d'attente dépassé. Vérifiez votre connexion et réessayez.
pt: Tempo de espera esgotado. Verifique sua conexão e tente novamente.
zh: 请求超时。请检查你的连接并重试。

# invalidInput
source: Invalid input. Please check your goal and try again.
fr: Entrée invalide. Vérifiez votre objectif et réessayez.
pt: Entrada inválida. Verifique sua meta e tente novamente.
zh: 输入无效。请检查你的目标并重试。

# noHabitsSelected
source: Please select at least one habit to save
fr: Veuillez sélectionner au moins une habitude à enregistrer
pt: Por favor selecione pelo menos um hábito para salvar
zh: 请至少选择一个习惯来保存

source: Try Again
fr: Réessayer
pt: Tentar Novamente
zh: 重试

# generationsRemaining
source: {count} generation(s) remaining this month
fr: {count} génération(s) restante(s) ce mois
pt: {count} geração(ões) restante(s) este mês
zh: 本月剩余{count}次生成

# poweredByGemini
source: Powered by Gemini AI
fr: Propulsé par Gemini AI
pt: Desenvolvido por Gemini AI
zh: 由Gemini AI驱动

source: Copied to clipboard
fr: Copié dans le presse-papiers
pt: Copiado para a área de transferência

source: Verses saved
fr: Versets sauvegardés
pt: Versículos salvos

source: Loading books...
fr: Chargement des livres...
pt: Carregando livros...

source: Select Book
fr: Sélectionner un Livre
pt: Selecionar Livro

# selectBookAndChapter
source: Select a book and chapter
fr: Sélectionnez un livre et un chapitre
pt: Selecione um livro e capítulo

source: Habits completed:
fr: Habitudes complétées:
pt: Hábitos concluídos:

# habitsCompletedCount
source: {completed} of {total}
fr: {completed} sur {total}
pt: {completed} de {total}

# error
source: Error: {message}
fr: Erreur: {message}
pt: Erro: {message}

source: Choose Your Experience
fr: Choisissez votre expérience
pt: Escolha sua experiência

# displayModeDescription
source: Select how you want to use Habitus Faith
fr: Sélectionnez comment vous souhaitez utiliser Habitus Faith
pt: Selecione como você deseja usar o Habitus Faith

source: Compact Mode
fr: Mode compact
pt: Modo compacto

# compactModeDescription
source: Essential features for daily habit tracking
fr: Fonctionnalités essentielles pour le suivi quotidien des habitudes
pt: Recursos essenciais para rastreamento diário de hábitos

# compactModeFeature1
source: Clean, minimalist interface
fr: Interface épurée et minimaliste
pt: Interface limpa e minimalista

# compactModeFeature2
source: Quick habit tracking
fr: Suivi rapide des habitudes
pt: Rastreamento rápido de hábitos

# compactModeFeature3
source: Basic statistics
fr: Statistiques de base
pt: Estatísticas básicas

source: Advanced Mode
fr: Mode avancé
pt: Modo avançado

# advancedModeDescription
source: Full-featured experience with insights and analytics
fr: Expérience complète avec analyses et perspectives
pt: Experiência completa com análises e insights

# advancedModeFeature1
source: Detailed habit analytics
fr: Analyses détaillées des habitudes
pt: Análises detalhadas de hábitos

# advancedModeFeature2
source: AI-powered insights
fr: Informations alimentées par l'IA
pt: Insights alimentados por IA

# advancedModeFeature3
source: Advanced customization
fr: Personnalisation avancée
pt: Personalização avançada

# changeAnytime
source: You can change this setting anytime in preferences
fr: Vous pouvez modifier ce paramètre à tout moment dans les préférences
pt: Você pode alterar esta configuração a qualquer momento nas preferências

source: Select Mode
fr: Sélectionner le mode
pt: Selecionar modo

source: Display Mode
fr: Mode d'affichage
pt: Modo de exibição

# displayModeUpdated
source: Display mode updated to {mode}
fr: Mode d'affichage mis à jour vers {mode}
pt: Modo de exibição atualizado para {mode}

# compactModeSubtitle
source: Compact checklist - tap for details
fr: Liste compacte - appuyez pour les détails
pt: Lista compacta - toque para detalhes

# advancedModeSubtitle
source: Full tracking visible
fr: Suivi complet visible
pt: Rastreamento completo visível

source: Add Manually
fr: Ajouter Manuellement
pt: Adicionar Manualmente

# createCustomHabit
source: Create a custom habit
fr: Créer une habitude personnalisée
pt: Criar um hábito personalizado

source: Generate with AI
fr: Générer avec IA
pt: Gerar com IA

# aiCustomHabits
source: Custom habits with AI
fr: Habitudes personnalisées avec IA
pt: Hábitos personalizados com IA

# previewHabitName
source: Habit name
fr: Nom de l'habitude
pt: Nome do hábito

# previewHabitDescription
source: Habit description
fr: Description de l'habitude
pt: Descrição do hábito

# chooseHabitType
source: What type of habit do you want to add?
fr: Quel type d'habitude souhaitez-vous ajouter ?
pt: Que tipo de hábito você deseja adicionar?

# chooseFromPredefined
source: Choose from predefined habits
fr: Choisissez une habitude prédéfinie
pt: Escolha um hábito predefinido

source: Custom
fr: Personnalisé
pt: Personalizado

# defaultHabit
source: Default
fr: Prédéfini
pt: Padrão

# addHabitDiscoverySubtitle
source: Choose how you want to add your new habit: you can create a custom one or select a predefined habit to get started faster.
fr: Choisissez comment ajouter votre nouvelle habitude : créez-en une personnalisée ou sélectionnez une habitude prédéfinie pour commencer plus rapidement.
pt: Escolha como deseja adicionar seu novo hábito: você pode criar um personalizado ou selecionar um predefinido para começar mais rápido.

# requiredFieldLabel
source: Required
fr: Obligatoire
pt: Obrigatório

source: Back
fr: Retour
pt: Voltar

source: Select all
fr: Tout sélectionner
pt: Selecionar todos

source: Manual
fr: Manuel

source: Mental
zh: 心理

source: Emoji
zh: 表情符号

# estimatedTime
source: ~{minutes} min
zh: 约{minutes}分钟
